#include<iostream>
using namespace std;

//-------------------------------------------------------------
// 1 задание
//-------------------------------------------------------------
void Zadan1()
{
	const int MIN = 10;
	const int MAX = 20;
	int num1, num2;
	cout << "Введите два числа\nпервое число: ";
	cin >> num1;
	cout << "второе число: ";
	cin >> num2;
	if ((num1 + num2 >= MIN) && (num1 + num2 <= MAX))
	{
		cout << "true" << endl;
	}
	else
	{
		cout << "false" << endl;
	}
}

//-------------------------------------------------------------
// 2 задание
//-------------------------------------------------------------
void Zadan2()
{
	const int num1 = 4;
	const int num2 = 6;
	if (((num1 == num2) && (num1 == 10) && (num2 == 10)) || (num1 + num2 == 10))
	{
		cout << "true" << endl;
	}
	else
	{
		cout << "false" << endl;
	}
}
//-------------------------------------------------------------
// 3 задание
//-------------------------------------------------------------
void Zadan3()
{
	int i = 1;
	cout << "Нечётные числа от 1 до 50: ";
	while (i != 50)
	{
		if (i % 2 != 0)
			cout << i << "  ";
		i++;
	}
	cout << endl;
}

//-------------------------------------------------------------
// 4 задание
//-------------------------------------------------------------
void Zadan4()
{
	int var, flag = 0;
	cout << "Введите число: ";
	cin >> var;
	for (int i=2; i<var; i++)
	{
		if (var % i == 0)
		{
			flag = 1;
			break;
		}
	}
	if (flag == 1)
	{
		cout << "Число не является простым" << endl;
	}
	else
	{
		cout << "Число простое" << endl;
	}
}

//-------------------------------------------------------------
// 5 задание
//-------------------------------------------------------------
void Zadan5()
{
	int year;
	do
	{
		cout << "Введите год: ";
		cin >> year;
		if (year <= 0)
		{
			cout << "Вы ввели отрицательное число !!! Введите положительное." << endl;
		}
	} while (year <= 0);
	
	if ((year % 4 == 0) && (year % 100 != 0) || (year % 400 == 0))
	{
		cout << "\nГод високосный" << endl;
	}
	else
	{
		cout << "\nГод не високосный" << endl;
	}
}
//-------------------------------------------------------------------------------------------------
int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	cout << "Задание 1" << endl;
	Zadan1();
	cout << "\nЗадание 2" << endl;
	Zadan2();
	cout << "\nЗадание 3" << endl;
	Zadan3();
	cout << "\nЗадание 4" << endl;
	Zadan4();
	cout << "\nЗадание 5" << endl;
	Zadan5();
return 0;
}