#include<iostream>
#include<locale>
using namespace std;
extern const int a, b, c, d;
int main()
{
	setlocale(LC_ALL, "RUSSIAN");

	//-----------------------------------------------------
	// 2 задание
	//-----------------------------------------------------
	int var1, var2;
	cout << "2 задание\nВведите целое число: "; cin >> var1;
	var2 = (var1 <= 21) ? (21 - var1) : (2 * (var1 - 21));
	cout << var2 << endl;
	//-----------------------------------------------------
	// 3 задание
	//-----------------------------------------------------
	int arr[3][3][3] = {
		{{1,1,1},
		{1,1,1},
		{1,1,1}},

		{{2,2,2},
		{2,5,2},
		{2,2,2}},

		{{3,3,3},
		{3,3,3},
		{3,3,3}}
	};
	int* ptr;
	ptr = &arr[1][1][1];
	cout << "\n3 задание\nЗначение центральной ячейки: " << *(ptr) << endl;


	//-----------------------------------------------------
	// 4 задание
	//-----------------------------------------------------
	cout << "\n4 задание\na*(b+(c/d)) = " << a * (b + (static_cast<float>(c) / d)) << endl;
	return 0;
}